YoungSooBae1224/SensorShield-EVK-003-nRF52/BM1383AGLV/mod/sensors.c
/*
The MIT License (MIT)
Copyright (c) 2020 Rohm Semiconductor

Permission is hereby granted, free of charge, to any person obtaining a
copy of this software and associated documentation files (the
"Software"), to deal in the Software without restriction, including
without limitation the rights to use, copy, modify, merge, publish,
distribute, sublicense, and/or sell copies of the Software, and to
permit persons to whom the Software is furnished to do so, subject to
the following conditions:

The above copyright notice and this permission notice shall be included
in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/


#include <stdint.h>
#include <string.h>

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "sensors.h"
#include "bm1383aglv_drv.h"

void BM1383AGLV_driver_init(struct platform_functions * p_functions) {

    ret_code_t ret;
    
    /* assign platform dedicated functions to driver. */
    BM1383AGLV_set_platform_functions(p_functions);
    
    /* init BM1383AGLV sensor. */
    ret = BM1383AGLV_init(BM1383AGLV_DEVICE_ADDRESS_5D);
    if (ret != NRF_SUCCESS) {
        NRF_LOG_INFO("BM1383AGLV_init fail=%d", ret);
        return;
    }
    
    ret = BM1383AGLV_start(BM1383AGLV_INT1, GPIO_POLARITY_HITOLO);
    if (ret != NRF_SUCCESS) {
        NRF_LOG_INFO("BM1383AGLV_start fail=%d", ret);
        return;
    }
    
    /* configure platform interrupt */
    nrf52_enable_interrupt(BM1383AGLV_INT1_PIN, GPIO_POLARITY_HITOLO, GPIO_PULLUP);
}

/**@brief Init sensor drivers.*/
void sensors_init(struct platform_functions * p_functions) {
    
    /* Add new sensor init here. */
    if (BM1383AGLV_ENABLED)
    {
        BM1383AGLV_driver_init(p_functions);
    }
}
